[NoCoverage] ConditionalExpression
src/TrafficLight.ts:8:14
     case 'red':
       return time === 1 ? 'green' : 'red';
     case 'yellow':
-      return time === 1 ? 'red' : 'yellow';
+      return true ? 'red' : 'yellow';
     case 'green':
       return time === 1 ? 'yellow' : 'green';

[NoCoverage] ConditionalExpression
src/TrafficLight.ts:10:14
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
     case 'green':
-      return time === 1 ? 'yellow' : 'green';
+      return true ? 'yellow' : 'green';
     default:
       throw new Error("This error shouldn't occur.");
