[Killed] ObjectLiteral
src/betterTrafficLight.ts:19:13
     nextColor: 'green',
     timeLeft: 20,
   },
-  'yellow': {
-    nextColor: 'red',
-    timeLeft: 5,
-  },
+  'yellow': {},
   'green': {
     nextColor: 'yellow',
killedBy: tests for colors after 1, yellow should change to red
statusReason: TypeError: Cannot read properties of undefined (reading 'timeLeft')

[Killed] BlockStatement
src/betterTrafficLight.ts:33:51
   },
 };
 
-export function getNextColor(color: Color): Color {
-  return trafficLightInfo[color].nextColor;
-}
+export function getNextColor(color: Color): Color {}
 
 export class TrafficLight {
killedBy: tests for timer after 1, time should be 15
statusReason: TypeError: Cannot read properties of undefined (reading 'timeLeft')

[Killed] StringLiteral
src/betterTrafficLight.ts:38:18
 }
 
 export class TrafficLight {
-  color: Color = 'red';
+  color: Color = "";
 
   timeLeft = 20;
killedBy: tests for timer after 1, time should be 15
statusReason: TypeError: Cannot read properties of undefined (reading 'nextColor')

[Killed] BlockStatement
src/betterTrafficLight.ts:43:17
   timeLeft = 20;
 
   /* simulate one second passing */
-  public tick() {
-    if (this.timeLeft === 1) {
-      this.color = getNextColor(this.color);
-      this.timeLeft = trafficLightInfo[this.color].timeLeft;
-    } else {
-      this.timeLeft -= 1;
-    }
-  }
+  public tick() {}
 
   public setTime(t: number) {
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 17

[Killed] ConditionalExpression
src/betterTrafficLight.ts:44:9
 
   /* simulate one second passing */
   public tick() {
-    if (this.timeLeft === 1) {
+    if (false) {
       this.color = getNextColor(this.color);
       this.timeLeft = trafficLightInfo[this.color].timeLeft;
killedBy: tests for timer after 1, time should be 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] BlockStatement
src/betterTrafficLight.ts:44:30
 
   /* simulate one second passing */
   public tick() {
-    if (this.timeLeft === 1) {
-      this.color = getNextColor(this.color);
-      this.timeLeft = trafficLightInfo[this.color].timeLeft;
-    } else {
+    if (this.timeLeft === 1) {} else {
       this.timeLeft -= 1;
     }
killedBy: tests for timer after 1, time should be 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 1

[Killed] BlockStatement
src/betterTrafficLight.ts:47:12
     if (this.timeLeft === 1) {
       this.color = getNextColor(this.color);
       this.timeLeft = trafficLightInfo[this.color].timeLeft;
-    } else {
-      this.timeLeft -= 1;
-    }
+    } else {}
   }
 
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 17
